_posts/2020-08-31-la-magia-de-los-namespaces.html
---
layout: post
title: "La magia de los namespaces"
excerpt: la concisión de los nombres en un módulo funciona como un indicador de la cohesión de ese módulo.
date: 2020-08-31 11:29:56
tags: [software, programación]
---

<p>
Mi primer contacto con la idea de <code>namespace</code> fue programando C++ en la Facultad.
En ese momento, para mí un namespace era pura sintaxis, algo que usabas para evitar conflictos de nombres entre tu código y el de terceros, apenas otro arma en la interminable batalla contra el compilador.
</p>

<p>
Un par de años después, cuando estaba aprendiendo Python y leí <a href="https://www.python.org/dev/peps/pep-0020/">el Zen</a>, me encontré con:
</p>

<blockquote>
<p>
Namespaces are one honking great idea &#x2013; let's do more of those!
</p>
</blockquote>

<p>
Supongo que esto me debe haber confundido un poco. El resto de las reglas del Zen tenían consecuencias prácticas muy evidentes, pero esta hablaba de algo que, a diferencia de lo que pasaba en C++, no formaba parte de la sintaxis lenguaje. En Python me resultaba más natural razonar en términos de funciones y clases, así que me olvidé de los namespaces.
</p>

<div class="org-center">
<p>
&lowast; &lowast; &lowast;
</p>
</div>

<p>
Fue recién con Clojure que la idea de namespaces se volvió una herramienta de diseño para mis programas. En Clojure hay muchas (tal vez demasiadas) formas de manipular un namespace e importar cosas desde otros módulos: <code>ns</code>, <code>require</code>, <code>refer</code>, <code>use</code>, <code>alias</code>, <code>import</code>&#x2026;
</p>

<p>
Un <a href="https://tonsky.me/blog/readable-clojure/">post de Nikita Prokopov</a> me ayudó no solo a ser consistente con mis requires, sino a empezar a prestar atención a cómo estas declaraciones afectan a la legibilidad de mis módulos, algo que tiene utilidad mucho más allá de Clojure. En particular, si uno reemplaza<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> advenjure.game <span style="color: #0000FF;">import</span> make_game, run_game
<span style="color: #0000FF;">from</span> advenjure.rooms <span style="color: #0000FF;">import</span> make_room, add_item
<span style="color: #0000FF;">from</span> advenjure.items <span style="color: #0000FF;">import</span> make_item

<span style="color: #BA36A5;">magazine</span> = make_item(<span style="color: #008000;">"sports magazine"</span>,
                     <span style="color: #008000;">"The cover read 'Sports Almanac 1950-2000'"</span>)

<span style="color: #BA36A5;">bedroom</span> = make_room(<span style="color: #008000;">"Bedroom"</span>, <span style="color: #008000;">"A smelling bedroom."</span>)
bedroom.add_item(magazine)

</pre>
</div>

<p>
Por su alternativa:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> advenjure.game <span style="color: #0000FF;">as</span> game
<span style="color: #0000FF;">import</span> advenjure.rooms <span style="color: #0000FF;">as</span> rooms
<span style="color: #0000FF;">import</span> advenjure.items <span style="color: #0000FF;">as</span> items

<span style="color: #BA36A5;">magazine</span> = items.make_item(<span style="color: #008000;">"sports magazine"</span>,
                           <span style="color: #008000;">"The cover read 'Sports Almanac 1950-2000'"</span>)

<span style="color: #BA36A5;">bedroom</span> = rooms.make_room(<span style="color: #008000;">"Bedroom"</span>, <span style="color: #008000;">"A smelling bedroom."</span>)
bedroom.add_item(magazine)
</pre>
</div>

<p>
El código se vuelve más legible: se hace evidente si un símbolo es local o se lo está trayendo de otro módulo (y cuál es ese módulo).
Y, citando a Nikita, grep vuelve a funcionar.
</p>

<p>
Se puede hacer una objeción al ejemplo anterior, sin embargo: la expresión <code>rooms.make_room</code>, más allá de ser un poco larga,
parece redundante. Y acá es donde empieza la magia: si aceptamos que siempre vamos
a referirnos a símbolos externos calificándolos con su namespace, podemos renombrar <code>rooms.make_room</code> a <code>rooms.make</code>.
Yendo un poco más lejos, probablemente sea evidente por contexto que <code>rooms.add_item</code> recibe un item por parámetro, entonces:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">magazine</span> = items.make(<span style="color: #008000;">"sports magazine"</span>,
                      <span style="color: #008000;">"The cover read 'Sports Almanac 1950-2000'"</span>)

<span style="color: #BA36A5;">bedroom</span> = rooms.make(<span style="color: #008000;">"Bedroom"</span>, <span style="color: #008000;">"A smelling bedroom."</span>)
bedroom.add(magazine)
</pre>
</div>

<p>
Lo interesante de trabajar de esta manera es que ciertos <a href="https://wiki.c2.com/?CodeSmell">code smells</a> empiezan a tener un correlato visual:
</p>

<ul class="org-ul">
<li>Si el módulo <code>game</code> define funciones <code>make_room</code> y <code>make_item</code>, resultaría ambiguo renombrar <code>game.make_game</code> a <code>game.make</code>. Posiblemente esto sea un indicio de que el módulo game no es cohesivo.</li>
<li>Si la entidad <code>game</code> se manipula con funciones del estilo <code>game.add_room</code>, <code>game.add_item</code> y <code>game.add_character</code>, posiblemente tenga demasiadas responsabilidades y sea útil introducir nuevas entidades.</li>
<li>Si mi módulo <code>room</code> está plagado de funciones con el prefijo <code>item.</code>, posiblemente padezca de <a href="https://wiki.c2.com/?FeatureEnvySmell">feature envy</a>.</li>
</ul>

<p>
En otras palabras: la concisión de los nombres en un módulo funciona como un indicador de la cohesión de ese módulo.
Zachary Tellman desarrolla esta idea con mucha claridad en el primer capítulo de <a href="https://elementsofclojure.com/">Elements of Clojure</a><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>:
</p>

<blockquote>
<p>
In theory, a namespace can hold an unlimited number of functions, as long as none of them share the same name. In practice, namespaces should hold functions which share a common purpose, so that <b>the namespace lends narrowness to the names inside it</b>. Typically, this means that all the functions should operate on a common datatype, a common data scope, or both.
</p>
</blockquote>

<p>
Claro que, como siempre en el software, hay que saber encontrar el balance:
</p>

<blockquote>
<p>
A large number of namespaces is taxing for our readers (&#x2026;). As such, we should add new namespaces only when necessary. By questioning the need for new namespaces, we implicitly question the need for new datatypes and data scopes, which will lead to simpler code overall.
</p>
</blockquote>

<div class="org-center">
<p>
&lowast; &lowast; &lowast;
</p>
</div>

<p>
Una de las cosas que me simpatiza de Erlang es que la propia sintaxis fomenta el método descripto arriba:
la única manera de llamar una función externa es calificándola con el módulo donde está definida:
<code>rooms:make/2</code>, <code>rooms:add/3</code>, <code>items:make/2</code>, etc. Como consecuencia, no hace falta "importar" las funciones que se van a usar en un módulo, sino que se
declaran las funciones (y, opcionalmente, los tipos) que se van a <i>exportar</i> desde ese módulo:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #808080;">-module</span>(rooms).

<span style="color: #808080;">-export</span>([<span style="color: #6434A3;">make/2</span>, <span style="color: #6434A3;">add/3</span>]).

<span style="color: #006699;">make</span>(<span style="color: #BA36A5;">Name</span>, <span style="color: #BA36A5;">Description</span>) -&gt;
  #{name =&gt; <span style="color: #BA36A5;">Name</span>,
    description =&gt; <span style="color: #BA36A5;">Description</span>,
    items =&gt; []}.

<span style="color: #006699;">add</span>(<span style="color: #BA36A5;">Room</span>, <span style="color: #BA36A5;">Item</span>, <span style="color: #BA36A5;">ItemRoomDescription</span>) -&gt;
  <span style="color: #BA36A5;">NewItems</span> = [{<span style="color: #BA36A5;">Item</span>, <span style="color: #BA36A5;">ItemRoomDescription</span>} | <span style="color: #6434A3;">maps</span>:<span style="color: #006FE0;">get</span>(items, <span style="color: #BA36A5;">Room</span>)],
  <span style="color: #6434A3;">maps</span>:<span style="color: #6434A3;">update</span>(items, <span style="color: #BA36A5;">NewItems</span>, <span style="color: #BA36A5;">Room</span>).
</pre>
</div>

<p>
Todas las funciones que no están declaradas en la lista del <code>export</code>, son internas del módulo, invisibles desde el exterior. Lo interesante de esta inversión de las declaraciones, más que el "ocultamiento de la información" (sobre el que no soy demasiado religioso), es que favorece la legibilidad: uno abre el archivo del módulo y, si tiene suerte, se encuentra con documentación y definiciones de tipos, pero aunque no tenga suerte puede ver la lista de exports para darse una idea de qué cosas se pueden hacer con ese módulo &mdash;cuál es su interfaz&mdash; y qué debería esperar encontrarse si decide seguir leyendo.
</p>
<div id="footnotes">
<!--h2 class="footnotes">Nota al pie de p&aacute;gina: </h2-->
<h2 class="footnotes">Notas: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Estos ejemplos fueron originalmente concebidos en Clojure, pero me pareció más amigable usar Python para fines ilustrativos.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
En ese primer capítulo (que <a href="https://leanpub.com/elementsofclojure/read_sample">se puede leer online</a>) se da el mejor tratamiento que conozco a la cuestión de poner nombres en software, y debería ser útil para cualquier programador, independientemente del lenguaje y el paradigma que use.
</p></div></div>


</div>
</div>
